<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Process;
use App\Jobs\ObjectDetection;

class PyController extends Controller
{
    public static function objectDetection($resource_id){

        // $indexes =  shell_exec('python ' . str_replace('\\', '/', base_path('storage\app\py_scripts\SSD_OD\main.py')) . " {$img_path}");

        // $coco_names = [
        //     "человек", "велосипед", "автомобиль", "мотоцикл", "самолет",
        //     "автобус", "поезд", "грузовик", "лодка", "светофор",
        //     "пожарный гидрант", "дорожный знак", "стоп-знак",
        //     "парковочный счетчик", "скамейка", "птица", "кот", "собака",
        //     "лошадь", "овца", "корова", "слон", "медведь", "зебра", "жираф",
        //     "шляпа", "рюкзак", "зонтик", "обувь", "очки", "сумка", "галстук",
        //     "чемодан", "фрисби", "лыжи", "сноуборд", "спортивный мяч",
        //     "воздушный змей", "бейсбольная бита", "бейсбольная перчатка",
        //     "скейтборд", "серфборд", "теннисная ракетка", "бутылка", "тарелка",
        //     "бокал для вина", "чашка", "вилка", "нож", "ложка", "миска", "банан",
        //     "яблоко", "бутерброд", "апельсин", "брокколи", "морковь", "хот-дог",
        //     "пицца", "пончик", "торт", "стул", "диван", "горшок с растением",
        //     "кровать", "зеркало", "обеденный стол", "окно", "письменный стол",
        //     "туалет", "дверь", "телевизор", "ноутбук", "мышь", "пульт управления",
        //     "клавиатура", "мобильный телефон", "микроволновая печь", "духовка",
        //     "тостер", "раковина", "холодильник", "блендер", "книга", "часы", "ваза",
        //     "ножницы", "мягкая игрушка", "фен", "зубная щетка", "расческа"
        // ];
        // // Массив для хранения слов, соответствующих индексам из $indexes
        // $words = [];
        // preg_match_all('/\d+/', $indexes, $matches);

        // // Получаем массив чисел из строки      
        // $numbers = $matches[0];

        // // Преобразуем числа из строки в числа
        // $indexes = array_map('intval', $numbers);
        // // Проходим по каждому индексу из $indexes и добавляем соответствующее слово в массив $words
        // foreach ($indexes as $index) {
        //     // Если индекс есть в словаре, добавляем соответствующее слово в массив $words
        //     if (isset($coco_names[$index])) {
        //         return $coco_names[$index];
        //         $words[] = $coco_names[$index];
        //     }
        // }       

        // return $words;
        ObjectDetection::dispatch($resource_id);
    }  
}
